{
  "name": "Paul Moss",
  "meta": {
    "format": "FRESH@0.6.0",
    "version": "0.1.0"
  },
  "info": {
      "label": "Software Engineer and Product Manager",
      "class": "Programmer",
      "image": "http://scorpionresponse.com/images/headshot.jpg",
      "brief": "A Product Manager responsible for the creation of a new product in an established company as well as a Software Engineer knowledgeable in many different aspects of creating modern applications. My experience covers all aspects of a product’s needs including oversight of the product development roadmap, evaluating technical architectures against future product goals, developing key components, reviewing legal documents, editing marketing copy, and providing input to overall business strategy."
  },
  "disposition": {
    "travel": 20,
    "authorization": "US Citizen",
    "commitment": ["contract", "permanent", "full-time"],
    "remote": true,
    "relocation": {
      "willing": false
    }
  },
  "contact": {
    "email": "moss.paul@gmail.com",
    "phone": "614-307-0617",
    "website": "http://scorpionresponse.com/"
  },
  "location": {
    "address": "5609 Telluride Bluff",
    "city": "Westerville",
    "code": "43081",
    "region": "Ohio",
    "country": "US"
  },
  "employment": {
    "summary": "5+ years as a product manager in the academic library industry.  7+ years software development.", 
    "history": [
      {
        "employer": "OCLC",
        "location": "Columbus, Ohio",
        "url": "http://oclc.org/",
        "position": "Product Manager",
        "summary": "Responsible for leading multiple teams of technical and non-technical staff to build a new product within the company that manages electronic resources (electronic journals and ebooks) for libraries.",
        "start": "2009",
        "end": "2014-12-20",
        "keywords": [
          "Agile",
          "Product Management",
          "Python",
          "MySQL",
          "Linux",
          "JIRA",
          "ebooks",
          "Bash"
        ],
        "highlights": [
          "First and only Product Manager for the WorldCat knowledge base, a product designed to manage the electronic resources in a library and sensibly integrate those resources into other products.",
          "Managed team of 11 support and development staff responsible for the ETL (Extract, Transform, Load) process which gathers all data used to drive the service.",
          "Worked closely with developers to define requirements and design of the application from the ground up.",
          "Significant work on the business strategy to guide a company primarily focused on printed materials into becoming a viable competitor in the market for electronic resource management systems.",
          "Responsible for ensuring all related departments produce work in alignment with overall product strategy and goals. This includes reviewing legal documents, marketing copy, training videos, product documentation, and business to business deals.",
          "Created a suite of data gathering and reporting processes in Python to be able to derive information about product usage and identify improvements for particular customers based on their configuration.",
          "Designed and implemented several data loading tools responsible for ETL tasks which have run continuously for several years."
        ]
      },
      {
        "employer": "OCLC",
        "location": "Bloomfield, NJ",
        "url": "http://oclc.org/",
        "position": "Lead Software Engineer",
        "start": "2008",
        "end": "2009",
        "summary": "Lead Java Enginneer for the WorldCat Link Manager product.",
        "keywords": [
          "Java",
          "MySQL",
          "Python",
          "Linux",
          "Bash",
          "Tomcat"
        ],
        "highlights": [
          "Determined significant aspects of product strategy including which features to develop at any given time.",
          "Responsible for Linux server maintenance and production support of the application.",
          "Served as second line customer support."
        ]
      },
      {
        "employer": "OCLC",
        "url": "http://oclc.org/",
        "Location": "Bloomfield, NJ",
        "position": "Senior Product Support Specialist",
        "start": "2005-05-05",
        "end": "2008",
        "summary": "The single person responsible for all customer support of 200+ customers.",
        "keywords": [
          "Perl",
          "Bash",
          "Linux",
          "Java"
        ],
        "highlights": [
          "Single point of contact for all customer support for 200+ customers.",
          "During this period the number of customers grew from 20 to 200. Throughout I improved the quality of support I provided and still kept the support process sustainable for a single person to accomplish without much involvement from development staff.",
          "Worked closely with our data production team to build our in-house developed Perl ETL process for gathering third party metadata."
        ]
      },
      {
        "employer": "Princeton University Library",
        "url": "http://library.princeton.edu/",
        "location": "Princeton, NJ",
        "position": "Senior Bibliographic Specialist",
        "start": "2001",
        "end": "2005-04",
        "summary": "Member of the Interlibrary Loan department, serving as the first person responsible for receiving requests from students and faculty for materials not available in our library.",
        "keywords": [
          "ILLiad",
          "ASP.NET",
          "C#"
        ],
        "highlights": [
          "Provided technical support for other department members on our ILLiad (software for managing Interlibrary Loan requests) installation as well as general computer support.",
          "Created a suite of statistics and reports in a Microsoft Access database and an ASP.NET web interface."
        ]
      }
    ]
  },
  "projects": [  ],
  "skills": {  },
  "education": {
    "summary": "Two bachelor's degrees, one in Computer Science and one in Physics, earned in three years at Rutgers University.",
    "level": "degree",
    "degree": "BS",
    "history": [
      {
        "institution": "Rutgers University",
        "title": "BS - Computer Science",
        "url": "http://www.rutgers.edu/",
        "location": "New Brunswick, NJ",
        "start": "2000",
        "end": "2003",
        "summary": "BS in Computer Science"
      },
      {
        "institution": "Rutgers University",
        "title": "BS - Physics",
        "url": "http://www.rutgers.edu/",
        "location": "New Brunswick, NJ",
        "start": "2000",
        "end": "2003",
        "summary": "BS in Physics"
      }
    ]
  },
  "writing": [
    {
      "title": "Replacing MARC: Where to Start",
      "category": "article",
      "publisher": {
        "name": "National Information Standards Organization",
        "url": "http://www.niso.org"
      },
      "url": "http://dx.doi.org/10.3789/isqv25no4.2013.03",
      "author": ["Paul Moss"],
      "summary": "The MARC format for transmittal of bibliographic records has been an unparalleled success for interlibrary communication. This success, however, has also brought about a world that deals exclusively in MARC and is inherently bound by its limitations. Several efforts over the years have been made to break free of these perceived limitations, but these efforts often miss the crucial mis-step of MARC-like thinking: that a library interchange format should be the only way to ingest, expose, or build systems around bibliographic data. In order to begin a transition away from MARC, each function MARC serves should be examined independently and may be replaced by a different technology.",
      "date": "2013-12"
    },
    {
      "title": "Building and Maintaining Knowledge Bases for OpenURL Link Resolvers Processes, Procedures, and Challenges",
      "category": "article",
      "publisher": "Against the Grain",
      "url": "http://www.against-the-grain.com/2011/03/v-23-1-building-and-maintaining-knowledge-bases-for-openurl-link-resolvers-processes-procedures-and-challenges/",
      "author": [
        "Christine Stohn",
        "Sherrard Ewing",
        "Sheri Meares",
        "Paul Moss"
      ],
      "date": "2011-01-01"
    }
  ],
  "governance": [
    {
      "summary": "Member of the KBART Working Group, Phase 2.",
      "category": "standards group",
      "role": "member",
      "organization": "NISO / UKSG",
      "start": "2012",
      "end": "2014",
      "highlights": [
        "Addended monthly committee calls.",
        "Co-authored an article of the usefulness of the standard with other committe members.",
        "Successfully delivered a Phase 2 version of the standard."
      ]
    }
  ],
  "social": [
    {
      "label": "GitHub",
      "network": "GitHub",
      "user": "ScorpionResponse",
      "url": "https://github.com/ScorpionResponse"
    },
    {
      "label": "LinkedIn",
      "network": "LinkedIn",
      "user": "paul-moss-8928a71b",
      "url": "https://www.linkedin.com/in/paul-moss-8928a71b"
    }
  ],
  "languages": [
    {
      "language": "English",
      "level": "Native"
    }
  ]
}
